# #task1
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# for x in a:
#     if x<=5:
#         print(x)


# # task2
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]



# task3
# s = 'You have a good attitude, in this session'
# print(s.count('a'))


# task4
# a = 'sting'
# b = 9
# a,b = b,a
# print(a,b)




# task5
# a = [9, 1, 10, 4, 0, 5, 7]
# for x in a:
#     item = a.count(x)
#     if item > 1:
#         print('not')
#     else:
#         print('unique')




# task6
# x = input('enter words: ').split()
# y = input('enter words: ').split()
# z = []
# for item in x:
#     if item not in y:
#         z.append(item)
# print(z)




# task7
# При заданном целом числе n посчитайте n + nn + nnn.
# numbers = ('5')*6
# print(numbers)



# # task8
# my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}
# for value in my_dict.values():
#     print(value)
# print(max(my_dict))
# print(my_dict['b'], my_dict['c'],my_dict['e'])



# task9







# # task10
# Дан список из чисел и индекс элемента в списке k.
#  Удалите из списка элемент с индексом k, сдвинув влево все элементы, стоящие правее элемента с индексом k.

# numbers = [1,2,3,4,5,6,7,8,9]
# # numbers.remove()
# print(numbers.remove(3))



# task11






перебираем в цикле. старый и новый лист. условие если этот элемент есть в старом листе то аппенди в новом
